[
  {
    "term": "Blockchain",
    "definition": "A digital ledger of transactions that is duplicated and distributed across the entire network of computer systems on the blockchain."
  },
  {
    "term": "Cryptocurrency",
    "definition": "A digital or virtual currency that is secured by cryptography, making it nearly impossible to counterfeit or double-spend."
  },
  {
    "term": "Bitcoin",
    "definition": "The first and most widely recognized cryptocurrency, created in 2009 by an unknown person or group using the pseudonym Satoshi Nakamoto."
  },
  {
    "term": "Altcoin",
    "definition": "Any cryptocurrency other than Bitcoin."
  },
  {
    "term": "Mining",
    "definition": "The process of validating transactions and adding them to the blockchain ledger, often rewarded with new coins."
  },
  {
    "term": "Wallet",
    "definition": "A digital tool that allows users to store and manage their cryptocurrencies."
  },
  {
    "term": "Smart Contract",
    "definition": "Self-executing contracts with the terms directly written into code, automatically enforcing and executing agreements."
  },
  {
    "term": "DeFi",
    "definition": "Decentralized Finance; financial services built on blockchain technology that operate without centralized intermediaries."
  },
  {
    "term": "NFT",
    "definition": "Non-Fungible Token; a unique digital asset that represents ownership of a specific item or piece of content."
  },
  {
    "term": "Staking",
    "definition": "The process of actively participating in transaction validation on a proof-of-stake blockchain, often by locking up coins."
  },
  {
    "term": "ICO",
    "definition": "Initial Coin Offering; a fundraising method where new projects sell their cryptocurrency tokens to early investors."
  },
  {
    "term": "Airdrop",
    "definition": "A distribution of a cryptocurrency token or coin, usually for free, to numerous wallet addresses."
  },
  {
    "term": "HODL",
    "definition": "A term derived from a misspelling of 'hold' that refers to the strategy of buying and holding cryptocurrency regardless of price fluctuations."
  },
  {
    "term": "Gas",
    "definition": "A fee required to perform a transaction or execute a contract on the Ethereum blockchain network."
  },
  {
    "term": "Tokenomics",
    "definition": "The economics of a token or cryptocurrency, including its creation, distribution, and management."
  },
  {
    "term": "Yield Farming",
    "definition": "The practice of staking or lending crypto assets to generate high returns or rewards in the form of additional cryptocurrency."
  },
  {
    "term": "Liquidity Pool",
    "definition": "A collection of funds locked in a smart contract, used to facilitate decentralized trading, lending, and other functions."
  },
  {
    "term": "DAO",
    "definition": "Decentralized Autonomous Organization; an organization represented by rules encoded as a computer program that is transparent and controlled by the organization members."
  },
  {
    "term": "Layer 2",
    "definition": "A secondary framework or protocol built on top of an existing blockchain to improve its scalability and efficiency."
  },
  {
    "term": "Fiat",
    "definition": "Government-issued currency that is not backed by a physical commodity, such as gold or silver."
  }
]

